spec/fixtures/invalid_PU_AP_ALMA_INVOICE_DEATILS_example.xml

<?xml version='1.0'?>
<query numrows="3" queryname="PU_AP_ALMA_INVOICE_DETAILS" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:noNamespaceSchemaLocation="">
<row rownumber="1">
<INVOICE_ID><![CDATA[]]></INVOICE_ID>
<PYMNT_SELCT_STATUS><![CDATA[Paid]]></PYMNT_SELCT_STATUS>
<INVOICE_DATE><![CDATA[20210431]]></INVOICE_DATE>
<PAYMENT_VOUCHER_DATE><![CDATA[20210603]]></PAYMENT_VOUCHER_DATE>
<VOUCHER_ID><![CDATA[A9999966]]></VOUCHER_ID>
<PAID_AMT>70.6</PAID_AMT>
<CURRENCY_PYMNT><![CDATA[USD]]></CURRENCY_PYMNT>
<PYMNT_MESSAGE/>
</row>
</query>
